const {re, wrap} = require('./define');

// 数字：^[0-9]*$
exports.digits = /[0-9]+/;

// n位的数字：^\d{n}$
exports.digits_n = /\d{n}/;

// 至少n位的数字：^\d{n,}$
exports.digits_n_ = /\d{n,}/;

// m-n位的数字：^\d{m,n}$
exports.digits_m_n = /\d{m, n}/;

//5 零和非零开头的数字：^(0|[1-9][0-9]*)$
exports.integer = /(0|[1-9][0-9]*)/;

// 最多带两位小数的数字：^([1-9][0-9]*)+(.[0-9]{1,2})?$
exports.fixed2 = wrap.and(/@integer(:.[0-9]{1,2})?/);
// simpler code
exports.fixed2 = [/@integer(:.[0-9]{1,2})?/]; // array is for rewrap

//7 带1-2位小数的正数或负数：^(\-)?\d+(\.\d{1,2})?$
//8 正数、负数、和小数：^(\-|\+)?\d+(\.\d+)?$
//9 有两位小数的正实数：^[0-9]+(.[0-9]{2})?$
//10 有1~3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$
//11 非零的正整数：^[1-9]\d*$ 或 ^([1-9][0-9]*){1,3}$ 或 ^\+?[1-9][0-9]*$
//12 非零的负整数：^\-[1-9][]0-9"*$ 或 ^-[1-9]\d*$
//13 非负整数：^\d+$ 或 ^[1-9]\d*|0$
//14 非正整数：^-[1-9]\d*|0$ 或 ^((-\d+)|(0+))$
//15 非负浮点数：^\d+(\.\d+)?$ 或 ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$
//16 非正浮点数：^((-\d+(\.\d+)?)|(0+(\.0+)?))$ 或 ^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$
//17 正浮点数：^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$ 或 ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$
//18 负浮点数：^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$ 或 ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$

//19 浮点数：^(-?\d+)(\.\d+)?$ 或 ^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$
exports.float = /(-?\d+)(\.\d+)?/;
exports.float2 = /^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)/;


//1 汉字：^[\u4e00-\u9fa5]{0,}$
exports.hanzi = /[\u4e00-\u9fa5]/;

` 2 英文和数字：^[A-Za-z0-9]+$ 或 ^[A-Za-z0-9]{4,40}$
 3 长度为3-20的所有字符：^.{3,20}$
 4 由26个英文字母组成的字符串：^[A-Za-z]+$
 5 由26个大写英文字母组成的字符串：^[A-Z]+$
 6 由26个小写英文字母组成的字符串：^[a-z]+$
 7 由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$
 8 由数字、26个英文字母或者下划线组成的字符串：^\w+$ 或 ^\w{3,20}$
 9 中文、英文、数字包括下划线：^[\u4E00-\u9FA5A-Za-z0-9_]+$
10 中文、英文、数字但不包括下划线等符号：^[\u4E00-\u9FA5A-Za-z0-9]+$ 或 ^[\u4E00-\u9FA5A-Za-z0-9]{2,20}$
11 可以输入含有^%&',;=?$\"等字符：[^%&',;=?$\x22]+
12 禁止输入含有~的字符：[^~\x22]+
`